'''8、 企业发放奖金
【问题描述】
企业发放的奖金根据利润提成。利润 I 低于或等于 10 万元时,奖金可提 10%;利润高
于 10 万元,低于 20 万元时,低于等于 10 万元的部分按 10%提成,高于 10 万元的部分,
可提成 7.5%;20 万到 40 万之间时,高于 20 万元的部分,可提成 5%;40 万到 60 万之间时
高于 40 万元的部分,可提成 3%; 60 万到 100 万之间时,高于 60 万元的部分,可提成 1.5%,
高于 100 万元时,超过 100 万元的部分按 1%提成,从键盘输入当月利润 I,求应发放奖金
总数?
【输入】
当月利润 I。
【输出】
应发放奖金总数,具体格式见输出样例。
【输入样例 1】
当月利润:120000
【输出样例 1】
11500.0
【输入样例 2】
当月利润:220000
【输出样例 2】
18500'''


I =int(input('当月利润: '))
if I <= 100000:
    I = I*0.1
elif I< 200000:
    I = (I-100000)*0.075 + 100000*0.1
elif I <= 400000:
    I = (I-200000)*0.05 + 100000*0.075 + 100000*0.1
elif I <= 600000:
    I = (I - 400000) * 0.03 + 200000*0.05 + 100000*0.075 + 100000*0.1
elif I <= 1000000:
    I = (I - 6000000) * 0.015 + 200000*0.03 + 200000*0.05 + 100000*0.075 + 100000*0.1
else:
    I = I*0.01 + 400000*0.015 + 200000*0.03 + 200000*0.05 + 100000*0.075 + 100000*0.1
I=int(I)
print(I)

